letters_rules = {
'\u0621': "\u05D0'",  # ء: א'
'\u0622': "\u05D0",  # آ: א
'\u0623': "\u05D0",  # أ: א
'\u0624': "",  # ؤ: ""
'\u0625': "\u05D0",  # إ: א
'\u0626': "",  # ئ: ''
'\u0627': "\u05D0",  # ا: א
'\u0628': "\u05D1\u05BC",  # ب: בּ
'\u0629': "\u05D4",  # ة: ה
'\u062A': "\u05EA",  # ت: ת
'\u062B': "\u05EA'",  # ث: ת'
'\u062C': "\u05D2'",  # ج: ג'
'\u062D': "\u05D7",  # ح: ח
'\u062E': "\u05D7'",  # خ: ח'
'\u062F': "\u05D3",  # د: ד
'\u0630': "\u05D3'",  # ذ: ד'
'\u0631': "\u05E8",  # ر: ר
'\u0632': "\u05D6",  # ز: ז
'\u0633': "\u05E1",  # س: ס
'\u0634': "\u05E9\u05C1",  # ش: שׁ
'\u0635': "\u05E6",  # ص: צ
'\u0636': "\u05E6'",  # ض: צ'
'\u0637': "\u05D8",  # ط: ט
'\u0638': "\u05D8'",  # ظ: ט'
'\u0639': "\u05E2",  # ع: ע
'\u063A': "\u05E2'",  # غ: ע'
'\u0640': "",  # ـ:
'\u0641': "\u05E4",  # ف: פ
'\u0642': "\u05E7",  # ق: ק
'\u0643': "\u05DB\u05BC",  # ك: כּ
'\u0644': "\u05DC",  # ل: ל
'\u0645': "\u05DE",  # م: מ
'\u0646': "\u05E0",  # ن: נ
'\u0647': "\u05D4",  # ه: ה
'\u0648': "\u05D5",  # و: ו
'\u0649': "\u05D0",  # ى: א
'\u064A': "\u05D9",  # ي: י
}

signs_rules = {
    '\u064B': "\u05B7\u05DF",  # ً: ַן
    '\u064C': "\u05BB\u05DF",  # ٌ: ֻן
    '\u064D': "\u05B4\u05DF",  # ٍ: ִן
    '\u064E': "\u05B7",  # َ: ַ
    '\u064F': "\u05BB",  # ُ: ֻ
    '\u0650': "\u05B4",  # ِ: ִ
    '\u0651': "\u0651",  # ّ: ّ
    '\u0652': "\u05B0",  # ْ: ְ
    '\u060c': ',',  # ،: ,
}

suffix_letters_rules = {
    '\u05E0': '\u05DF',  # נ, ן
    '\u05DE': '\u05DD',  # מ, ם
    '\u05E6': '\u05E5',  # צ, ץ
    '\u05E4': '\u05E3',  # פ, ף
}

hebrew_letters = [chr(i) for i in range(0x05D0, 0x05EB)]


def get_letters_rules():
    return letters_rules


def get_signs_rules():
    return signs_rules


def get_suffix_letters_rules():
    return suffix_letters_rules


def get_hebrew_letters():
    return hebrew_letters

